# ==============================================================
# Departamento de Ingeniería Mecánica - Universidad de Chile
# Trabajo de Memoria de Título:
# "Implementación de algoritmos de reconocimiento de objetos
#  para la identificación de fallas en correas transportadoras"
# Autor: Fernando N.
# --------------------------------------------------------------
# Archivo: yolo11.yaml
# Definición estructural del modelo YOLOv11 (tarea: detección)
# Basado en la arquitectura oficial Ultralytics YOLOv11 2025.
# ==============================================================

# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11 detection model
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 5  # number of classes (Hole, Impact Damage, Puncture, Tear, Wear)

scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 162 layers, ~4.6M params, 8.7 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 162 layers, ~8.3M params, 15.5 GFLOPs
  m: [0.50, 1.00, 512]  # summary: 182 layers, ~17.8M params, 26.2 GFLOPs
  l: [1.00, 1.00, 512]  # summary: 242 layers, ~25.1M params, 36.8 GFLOPs
  x: [1.00, 1.50, 512]  # summary: 242 layers, ~46.8M params, 71.5 GFLOPs

# ==============================================================
# YOLO11 Backbone
# - Extrae características jerárquicas multiescala
# - Basado en bloques C3k2 (reemplazo de C2f)
# - Incluye atención paralela C2PSA (similar a PSA de YOLOv10)
# ==============================================================

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]           # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]   # Stage 1
  - [-1, 1, Conv, [256, 3, 2]]          # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]   # Stage 2
  - [-1, 1, Conv, [512, 3, 2]]          # 5-P4/16
  - [-1, 2, C3k2, [512, True]]          # Stage 3
  - [-1, 1, Conv, [1024, 3, 2]]         # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]         # Stage 4
  - [-1, 1, SPPF, [1024, 5]]            # 9 - Spatial Pyramid Pooling (Fast)
  - [-1, 2, C2PSA, [1024]]              # 10 - Parallel Spatial Attention

# ==============================================================
# YOLO11 Head
# - Fusión FPN+PAN para multiescala
# - Predicciones a 3 niveles (P3, P4, P5)
# - Anchor-free (sin NMS explícito)
# ==============================================================

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 11 ↑
  - [[-1, 6], 1, Concat, [1]]                    # 12 cat backbone stage 3
  - [-1, 2, C3k2, [512, False]]                  # 13 refine

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 14 ↑
  - [[-1, 4], 1, Concat, [1]]                    # 15 cat stage 2
  - [-1, 2, C3k2, [256, False]]                  # 16 refine

  - [-1, 1, Conv, [256, 3, 2]]                   # 17 ↓
  - [[-1, 13], 1, Concat, [1]]                   # 18 cat P4
  - [-1, 2, C3k2, [512, False]]                  # 19 refine

  - [-1, 1, Conv, [512, 3, 2]]                   # 20 ↓
  - [[-1, 10], 1, Concat, [1]]                   # 21 cat P5
  - [-1, 2, C3k2, [1024, True]]                  # 22 refine deep features

  - [[16, 19, 22], 1, Detect, [nc]]              # 23 Detect (small, medium, large)
